Revit 2024 API
GeomCombinationSet Class
A set that contains GeomCombination objects.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class GeomCombinationSet : APIObject,
	IEnumerable
Visual Basic
Public Class GeomCombinationSet _
	Inherits APIObject _
	Implements IEnumerable
Visual C++
public ref class GeomCombinationSet : public APIObject,
	IEnumerable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.GeomCombinationSet
See Also
GeomCombinationSet Members
Autodesk.Revit.DB Namespace